sterentev/atdf-device-asm-include/inc/ATmega168PB.inc
; ----------	Register SPMCSR bits		------------------------
.equ	SPMIE		= 7		; 0x80 - SPM Interrupt Enable
.equ	RWWSB		= 6		; 0x40 - Read-While-Write Section Busy
.equ	SIGRD		= 5		; 0x20 - Signature Row Read
.equ	RWWSRE		= 4		; 0x10 - Read-While-Write section read enable
.equ	BLBSET		= 3		; 0x08 - Boot Lock Bit Set
.equ	PGWRT		= 2		; 0x04 - Page Write
.equ	PGERS		= 1		; 0x02 - Page Erase
.equ	SPMEN		= 0		; 0x01 - Store Program Memory

; ----------	Register MCUCR bits		------------------------
.equ	BODS		= 6		; 0x40 - BOD Sleep
.equ	BODSE		= 5		; 0x20 - BOD Sleep Enable
.equ	PUD		= 4		; 0x10 - 
.equ	IVSEL		= 1		; 0x02 - 
.equ	IVCE		= 0		; 0x01 - 

; ----------	Register MCUSR bits		------------------------
.equ	WDRF		= 3		; 0x08 - Watchdog Reset Flag
.equ	BORF		= 2		; 0x04 - Brown-out Reset Flag
.equ	EXTRF		= 1		; 0x02 - External Reset Flag
.equ	PORF		= 0		; 0x01 - Power-on reset flag

; ----------	Register SMCR bits		------------------------
.equ	SM_MASK		= 0x0E		;      - Sleep Mode Select Bits (3 bits)
.equ	SM0		= 1		;          SM BIT0 position
.equ	SE		= 0		; 0x01 - Sleep Enable
; ::::  SM	:::: bitfield values
;			0x00		; Idle
;			0x02		; ADC Noise Reduction (If Available)
;			0x04		; Power Down
;			0x06		; Power Save
;			0x08		; Reserved
;			0x0A		; Reserved
;			0x0C		; Standby
;			0x0E		; Extended Standby




; **********************************************************************
; ***************	EXTRA BITFIELDS VALUES	************************
; **********************************************************************
;
; ::::  COMM_SCK_RATE_3BIT	:::: values
;			0b000		; fosc/4
;			0b001		; fosc/16
;			0b010		; fosc/64
;			0b011		; fosc/128
;			0b100		; fosc/2
;			0b101		; fosc/8
;			0b110		; fosc/32
;			0b111		; fosc/64



; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 27
.equ	INT_VECTORS_SIZE	= 0x36
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset
;	1	INT0		; External Interrupt Request 0
;	2	INT1		; External Interrupt Request 1
;	3	PCINT0		; Pin Change Interrupt Request 0
;	4	PCINT1		; Pin Change Interrupt Request 0
;	5	PCINT2		; Pin Change Interrupt Request 1
;	6	WDT		; Watchdog Time-out Interrupt
;	7	TIMER2_COMPA	; Timer/Counter2 Compare Match A
;	8	TIMER2_COMPB	; Timer/Counter2 Compare Match A
;	9	TIMER2_OVF	; Timer/Counter2 Overflow
;	10	TIMER1_CAPT	; Timer/Counter1 Capture Event
;	11	TIMER1_COMPA	; Timer/Counter1 Compare Match A
;	12	TIMER1_COMPB	; Timer/Counter1 Compare Match B
;	13	TIMER1_OVF	; Timer/Counter1 Overflow
;	14	TIMER0_COMPA	; TimerCounter0 Compare Match A
;	15	TIMER0_COMPB	; TimerCounter0 Compare Match B
;	16	TIMER0_OVF	; Timer/Counter0 Overflow
;	17	SPI_STC		; SPI Serial Transfer Complete
;	18	USART_RX	; USART Rx Complete
;	19	USART_UDRE	; USART, Data Register Empty
;	20	USART_TX	; USART Tx Complete
;	21	ADC		; ADC Conversion Complete
;	22	EE_READY	; EEPROM Ready
;	23	ANALOG_COMP	; Analog Comparator
;	24	TWI		; Two-wire Serial Interface
;	25	SPM_Ready	; Store Program Memory Read
;	26	USART_START	; USART Start Edge Interrupt


; ====	ASM PROGRAM SKELETON				========
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	INT_RESET	; RESET		 - External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset
;#		rjmp	INT_INT0	; INT0		 - External Interrupt Request 0
;#		reti			; INT1		 - External Interrupt Request 1
;#		rjmp	INT_PCINT0	; PCINT0	 - Pin Change Interrupt Request 0
;#		reti			; PCINT1	 - Pin Change Interrupt Request 0
;#		reti			; PCINT2	 - Pin Change Interrupt Request 1
;#		reti			; WDT		 - Watchdog Time-out Interrupt
;#		reti			; TIMER2_COMPA	 - Timer/Counter2 Compare Match A
;#		reti			; TIMER2_COMPB	 - Timer/Counter2 Compare Match A
;#		reti			; TIMER2_OVF	 - Timer/Counter2 Overflow
;#		reti			; TIMER1_CAPT	 - Timer/Counter1 Capture Event
;#		reti			; TIMER1_COMPA	 - Timer/Counter1 Compare Match A
;#		reti			; TIMER1_COMPB	 - Timer/Counter1 Compare Match B
;#		reti			; TIMER1_OVF	 - Timer/Counter1 Overflow
;#		reti			; TIMER0_COMPA	 - TimerCounter0 Compare Match A
;#		reti			; TIMER0_COMPB	 - TimerCounter0 Compare Match B
;#		reti			; TIMER0_OVF	 - Timer/Counter0 Overflow
;#		reti			; SPI_STC	 - SPI Serial Transfer Complete
;#		reti			; USART_RX	 - USART Rx Complete
;#		reti			; USART_UDRE	 - USART, Data Register Empty
;#		reti			; USART_TX	 - USART Tx Complete
;#		reti			; ADC		 - ADC Conversion Complete
;#		rjmp	INT_EE_READY	; EE_READY	 - EEPROM Ready
;#		reti			; ANALOG_COMP	 - Analog Comparator
;#		reti			; TWI		 - Two-wire Serial Interface
;#		reti			; SPM_Ready	 - Store Program Memory Read
;#		reti			; USART_START	 - USART Start Edge Interrupt
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	INT_RESET:
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATMEGA168PB_INC_ */

; ************************ END OF FILE *********************************

